Управление_торговлей.ПБТ/src/InformationRegisters/ПредопреденныеДанные/ПредопреденныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредопреденныеДанные</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/CommonModules/ПредопреденныеДанныеНаСервере/Module.bsl
Функция ПолучитьПредопреденныеДанные(ТипМетаданных, ИмяОбъекта) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредопреденныеДанные.Значение.Ссылка КАК Значение
		|ИЗ
		|	РегистрСведений.ПредопреденныеДанные КАК ПредопреденныеДанные
		|ГДЕ
		|	ПредопреденныеДанные.ТипМетаданных = &ТипМетаданных
		|	И ПредопреденныеДанные.ИмяОбъекта = &ИмяОбъекта";
	
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	Запрос.УстановитьПараметр("ТипМетаданных", ТипМетаданных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
	Возврат Неопределено;	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере() Экспорт 

	ЗаполнитьСправочникВидыИсследований();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСправочникВидыИсследований()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыИсследований.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыИсследований КАК ВидыИсследований";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗначений = Справочники.ВидыИсследований.ПолучитьПредопределенныеДанные();
	
	Для каждого Строка Из СписокЗначений Цикл
		ОбъектСпр = Справочники.ВидыИсследований.СоздатьЭлемент(); 
		ЗаполнитьЗначенияСвойств(ОбъектСпр, Строка);
		ОбъектСпр.Записать(); 
		ДобавитьЗаписьВРегстр(ОбъектСпр.Метаданные().Имя, Строка.Наименование, ОбъектСпр.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьВРегстр(ТипМетаданных, ИмяОбъекта, Значение)

	МенеджерЗаписи = РегистрыСведений.ПредопреденныеДанные.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипМетаданных = ТипМетаданных;
	МенеджерЗаписи.ИмяОбъекта = ИмяОбъекта;
	МенеджерЗаписи.Значение = Значение;
	МенеджерЗаписи.Записать();

КонецПроцедуры
